In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [10]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.737768 -0.910753
1  X   beta  0.440078  0.749134
2  Y  alpha -1.427651 -0.565104
3  Y   beta -1.611475 -0.346907
4  Z  alpha  2.141863  0.979295

In [11]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [12]:
group1

In [13]:
group1.mean()

k1
X   -0.148845
Y   -1.519563
Z    2.141863
Name: dataset1, dtype: float64

In [14]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [15]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.440078
    JAN   -1.427651
NY  FEB   -1.611475
    JAN    0.702048
Name: dataset1, dtype: float64

In [16]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.737768 -0.910753
1  X   beta  0.440078  0.749134
2  Y  alpha -1.427651 -0.565104
3  Y   beta -1.611475 -0.346907
4  Z  alpha  2.141863  0.979295

In [17]:
dframe.groupby('k1').mean()

/var/folders/_7/178775hs6nz5h81l3b_pbb8h0000gn/T/ipykernel_28313/1903047256.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.148845 -0.080810
Y  -1.519563 -0.456006
Z   2.141863  0.979295

In [18]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.737768 -0.910753
   beta   0.440078  0.749134
Y  alpha -1.427651 -0.565104
   beta  -1.611475 -0.346907
Z  alpha  2.141863  0.979295

In [19]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [21]:
for name,group in dframe.groupby('k1'):
    print('This is the %s group' %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.737768 -0.910753
1  X   beta  0.440078  0.749134


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.427651 -0.565104
3  Y   beta -1.611475 -0.346907


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  2.141863  0.979295

In [23]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('/n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.737768 -0.910753
/n
Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.440078  0.749134
/n
Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -1.427651 -0.565104
/n
Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -1.611475 -0.346907
/n
Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  2.141863  0.979295
/n

In [24]:
group_dict = dict(list(dframe.groupby('k1')))

In [25]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.737768 -0.910753
1  X   beta  0.440078  0.749134

In [28]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1))) 
#seperates dataframes by type of data along an axis of 1

In [27]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.737768 -0.910753
 1  0.440078  0.749134
 2 -1.427651 -0.565104
 3 -1.611475 -0.346907
 4  2.141863  0.979295,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [30]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.910753
   beta   0.749134
Y  alpha -0.565104
   beta  -0.346907
Z  alpha  0.979295